app/Controllers/Frontend/HomeController.php

    public function home_index()
    {
        $productModel = new DogFoodProductModel();
        $headerModel = new HeaderModel();
        $postModel = new PostModel();

        // Fetch only active products
        $data['products'] = $productModel
            ->where('product_is_active', 1)
            ->findAll();

        // Fetch active headers for navigation
        $data['headers'] = $headerModel
            ->where('is_active', 1)
            ->orderBy('id', 'ASC')
            ->findAll();

        // Fetch latest 3 posts for blog section with user names
        $userModel = new UserModel();
        $posts = $postModel
            ->orderBy('created_at', 'ASC')
            ->limit(3)
            ->findAll();

        foreach ($posts as &$post) {
            $user = $userModel->find($post['user_id']);
---
SELECT *
FROM `pat_dog_food_product`
WHERE `product_is_active` = 1
SELECT *
FROM `pat_users`
WHERE `pat_users`.`id` = '11'

    public function post_single($id)
    {
        $postModel = new PostModel();
        $headerModel = new HeaderModel();
        $userModel = new UserModel();

        $post = $postModel->find($id);
        if (!$post) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // Get author name
        $user = $userModel->find($post['user_id']);
        $post['author_name'] = $user ? $user['name'] : 'Admin';

        // Fetch active headers for navigation
        $data['headers'] = $headerModel
            ->where('is_active', 1)
            ->orderBy('id', 'ASC')
            ->findAll();

        // Fetch recent posts for sidebar (excluding current)
        $recentPosts = $postModel
            ->where('post_id !=', $id)
            ->orderBy('created_at', 'DESC')
            ->limit(3)
            ->findAll();

        foreach ($recentPosts as &$rp) {
            $u = $userModel->find($rp['user_id']);
---
SELECT *
FROM `pat_users`
WHERE `pat_users`.`id` = '11'