app/Controllers/Backend/DashboardController.php

SELECT *
FROM `pat_dog_food_product`
---
    public function index()
    {
        $model = new DogFoodProductModel();
        $data['products'] = $model->findAll();